# vim: syntax=ruby filetype=ruby

tap 'caskroom/versions'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'

brew 'brew-cask'
brew 'openssl'
brew 'ack'
brew 'ccat'
brew 'coreutils'
brew 'ssh-copy-id'
brew 'git'
brew 'heroku'
brew 'httpie'
brew 'jq'
brew 'binutils'
brew 'tmux'
brew 'go'
brew 'python3'
brew 'ruby'
brew 'nvm'
brew 'yarn'
brew 'tree'
brew 'sqlite'
brew 'mariadb'
brew 'postgresql'
brew 'gcc'
brew 'boost'
brew 'cmake'
brew 'cppcheck'
brew 'clang-format'
brew 'geckodriver'
brew 'spidermonkey'
brew 'android-platform-tools'
brew 'watch'
brew 'watchman'
# brew 'neovim', args: ['HEAD']

cask 'alfred'
cask 'bartender'
cask 'docker'
cask 'rust'
cask 'textual'
cask 'mactex'
cask 'electrum'
cask 'iterm2'
cask 'slack'
cask 'discord'
cask 'goofy'
cask 'microsoft-office'
cask 'google-chrome'
cask 'firefox'
cask 'firefoxnightly'
cask 'firefoxdeveloperedition'
cask 'spotify'
cask 'spotify-notifications'
cask 'tunnelblick'
cask 'font-fantasque-sans-mono'
